# Lab 2 Łączenie z bazą danych i instrukcja select

Połączenie z bazą danych przy pomocy sqlAlchemy

In [1]:
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

In [2]:
result_set = db.execute("SELECT * FROM city")  
# for r in result_set:  
    # print(r)

Połączenie z bazą danych przy pomocy psycopg2 i pandas

In [3]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

In [4]:
df = pd.read_sql('select * from city',con=connection)
df

/tmp/ipykernel_6299/494082925.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('select * from city',con=connection)

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

Połączenie za pomocą sqlAlchemy i pandas

In [5]:
df = pd.read_sql('select * from city', con=connection_sqlalchemy)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

# Ćwiczenie

1. Ile kategorii filmów mamy w wypożyczalni?

In [6]:
cat = pd.read_sql('select name from category', con=connection_sqlalchemy)
print ('Liczba kategorii filmowych w wypożyczalni: {}'.format(len(cat)))

Liczba kategorii filmowych w wypożyczalni: 16

2. Wyświetl listę kategorii w kolejności alfabetycznej.

In [7]:
cat_alphabetical = pd.read_sql('select name from category order by name asc', con=connection_sqlalchemy)
cat_alphabetical

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

3. Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [8]:
sadf = pd.read_sql('select * from film', con=connection_sqlalchemy)
sadf
film = pd.read_sql('select title from film order by release_year asc', con=connection_sqlalchemy)
print ('Najstarszy film: {}'.format(film['title'][0]))
print ('Najmłodszy film: {}'.format(film['title'][len(film['title']) - 1]))

Najstarszy film: Chamber Italian
Najmłodszy film: Zorro Ark

4. Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [9]:
rental_2005 = pd.read_sql('select rental_id from rental where rental_date >= \'2005-07-01\' AND rental_date < \'2005-08-01\'', con=connection_sqlalchemy)
print ('Liczba wypożyczeń pomiędzy 2005-07-01 a 2005-08-01: {}'.format(len(rental_2005)))

Liczba wypożyczeń pomiędzy 2005-07-01 a 2005-08-01: 6709

5. Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01

In [10]:
rental_2011 = pd.read_sql('select rental_id from rental where rental_date >= \'2011-01-01\' AND rental_date < \'2011-02-01\'', con=connection_sqlalchemy)
print ('Liczba wypożyczeń pomiędzy 2011-01-01 a 2011-02-01: {}'.format(len(rental_2011)))

Liczba wypożyczeń pomiędzy 2011-01-01 a 2011-02-01: 0

6. Znajdź największą płatność wypożyczenia.

In [11]:
biggest_payment = pd.read_sql('select amount from payment order by amount desc fetch first 1 row only;', con=connection_sqlalchemy)
biggest_payment

   amount
0   11.99

7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [12]:
customer_pnb = pd.read_sql("""select first_name, last_name from customer 
inner join address on customer.address_id=address.address_id
inner join city on address.city_id=city.city_id
inner join country on city.country_id=country.country_id
where country.country in ('Poland', 'Nigeria', 'Bangladesh')""", con=connection_sqlalchemy)
customer_pnb

   first_name  last_name
0       Sonia    Gregory
1       Brian      Wyman
2      Sidney   Burleson
3      Rodney    Moeller
4     Stephen     Qualls
5       Velma      Lucas
6     Marilyn       Ross
7       Elsie     Kelley
8      Gladys   Hamilton
9       Frank   Waggoner
10   Marjorie     Tucker
11      Carol     Garcia
12       Leah     Curtis
13      Ruben      Geary
14       Olga    Jimenez
15     Bertha   Ferguson
16     Tracey    Barrett
17         Jo     Fowler
18    Johnnie   Chisholm
19    Wallace      Slone
20   Michelle      Clark
21    Russell    Brinson
22     Jimmie  Eggleston
23  Constance       Reid

8. Gdzie mieszkają członkowie personelu?

In [13]:
staff_addr = pd.read_sql("""select address, address2 from address 
inner join staff on address.address_id=staff.address_id""", con=connection_sqlalchemy)
staff_addr

                address address2
0     23 Workhaven Lane     None
1  1411 Lillydale Drive     None

9. Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [14]:
staff_ah = pd.read_sql("""select staff_id from staff
inner join address on staff.address_id=address.address_id
inner join city on address.city_id=city.city_id
inner join country on city.country_id=country.country_id
where country.country in ('Argentina', 'Spain')""", con=connection_sqlalchemy)
print('Liczba pracowników z Argentyny lub Hiszpanii: {}'.format(len(staff_ah)))

Liczba pracowników z Argentyny lub Hiszpanii: 0

10. Jakie kategorie filmów zostały wypożyczone przez klientów?

In [15]:
cat_rented = pd.read_sql("""select distinct name from category
inner join film_category on category.category_id=film_category.category_id
inner join film on film_category.film_id=film.film_id
inner join inventory on film.film_id=inventory.film_id
inner join rental on inventory.inventory_id=rental.inventory_id
inner join customer on rental.customer_id=customer.customer_id""", con=connection_sqlalchemy)
cat_rented

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

11. Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [16]:
cat_usa = pd.read_sql("""select distinct name from category
inner join film_category on category.category_id=film_category.category_id
inner join film on film_category.film_id=film.film_id
inner join inventory on film.film_id=inventory.film_id
inner join rental on inventory.inventory_id=rental.inventory_id
inner join customer on rental.customer_id=customer.customer_id
inner join address on customer.address_id=address.address_id
inner join city on address.city_id=city.city_id
inner join country on city.country_id=country.country_id
where country='United States'""", con=connection_sqlalchemy)
cat_usa

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

12. Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley.

In [17]:
titles= pd.read_sql("""select distinct title from film
inner join film_actor on film.film_id=film_actor.film_id
inner join actor on film_actor.actor_id=actor.actor_id
where actor.first_name in ('Olympia', 'Julia', 'Ellen')
and actor.last_name in ('Pfeiffer', 'Zellweger', 'Presley')""", con=connection_sqlalchemy)
titles

                   title
0            Badman Dawn
1        Bilko Anonymous
2   Breakfast Goldfinger
3      Caribbean Liberty
4       Casper Dragonfly
..                   ...
64             Turn Star
65            Wait Cider
66          Women Dorado
67             Won Dares
68         Wyoming Storm

[69 rows x 1 columns]